In [47]:
list_global = []

In [48]:
import pandas as pd
from clip_func import clip

In [49]:
COLUMN_NAMES = [l for l in range(0, 104)]
df = pd.DataFrame(columns=COLUMN_NAMES, index=[0])

In [50]:
df_1 = clip()

In [51]:
df_1

,0,1,2,3,4,5,6,7,8,9,...,92,93,94,95,96,97,98,99,100,101
0,NaN,2305/0800,6445N/04030E,NaN,270/3,0/0,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Груза нет,"2205/1705 Сдано на т/к «Кама»: шлам=21,..."

In [52]:
df_1 = df_1.drop(columns=0)

In [53]:
df_1

,1,2,3,4,5,6,7,8,9,10,...,92,93,94,95,96,97,98,99,100,101
0,2305/0800,6445N/04030E,NaN,270/3,0/0,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Груза нет,"2205/1705 Сдано на т/к «Кама»: шлам=21,..."

In [54]:
df_1.to_csv('/home/mike-pi/Documents/coding/projects/disp/data/daily_cum.csv', index=False)